Repository: pepr/LearningToProgram2CZ
Catalog: en/align_2013.05.07_09.17.36/tutbranch-cztutbranch.tmx
Source language: en
Languages: cs

source: The uppercase names are simply a convention to indicate that they are constant values rather than conventional variables, but VBScript allows any variable name you like.
cs: Použití proměnných zapsaných velkými písmeny je předepsáno pouze konvencí. Dáváme tím najevo, že bychom je neměli chápat jako běžné proměnné, ale jako proměnné udržující konstantní hodnoty. Jazyk VBScript vám ale dovolí pojmenovat si proměnné podle své libosti.

source: Python multi-selection
cs: case v jazyce Python

source: Python does not provide an explicit case construct but rather compromises by providing an easier if/elseif/else format:
cs: Python explicitní konstrukci typu case nepodporuje. Místo toho nabízí kompromis v podobě if/elif/else:

source: menu = """ Pick a shape(1-3): 1) Square 2) Rectangle 3) Triangle """ shape = int(raw_input(menu)) if shape == 1: length = float(raw_input("Length: ")) print "Area of square = ", length ** 2 elif shape == 2: length = float(raw_input("Length: ")) width = float(raw_input("Width: )) print "Area of rectangle = ", length * width elif shape == 3: length = float(raw_input("Length: ")) width = float(raw_input("Width: )) print "Area of triangle = ", length * width else: print "Not a valid shape, try again"
cs: menu = """ Vyberte si tvar (1-3): 1) Ctverec 2) Obdelnik 3) Trojuhelnik """ tvar = int(raw_input(menu)) if tvar == 1: strana = float(raw_input("Strana: ")) print "Plocha ctverce = ", strana ** 2 elif tvar == 2: delka = float(raw_input("Delka: ")) sirka = float(raw_input("Sirka: ")) print "Plocha obdelniku = ", delka * sirka elif tvar == 3: zakladna = float(raw_input("Zakladna: ")) vyska = float(raw_input(" Vyska: ")) print "Plocha trojuhelniku = ", zakladna * vyska / 2 else: print "Neplatny tvar. Zkute to znovu"

source: Note the use of elif and the fact that the indentation (all important in Python) does not change (unlike the nested if statement example). It's also worth pointing out that both this technique and the earlier nested if/else example are equally valid, the elif technique is just a little easier to read if there are many tests.
cs: Povšimněte si použití elif a skutečnosti, že se (v porovnání s příkladem se zanořenými if) nemění odsazení, které je v Pythonu tak důležité. Za zmínku stojí i to, že oba zápisy — jak poslední zápis, tak dříve uvedený zápis využívající vnořených konstrukcí if/else — jsou funkčně shodné. Zápis využívající elif zvyšuje čitelnost v případech, kdy použijeme větší množství testů.

source: The final condition is an else which catches anything not caught by the previous tests, just like the default in JavaScript and Case Else in VBScript.
cs: V koncové větvi else se zachytí všechny případy, které nebyly zachyceny v předchozích testech. Odpovídá to použití default v JavaScript nebo Case Else v jazyce VBScript.

source: VBScript also provides a slightly more cumbersome version of this technique with ElseIf...Then which is used in exactly the same way as the Python elif but is rarely seen since Select Case is easier to use.
cs: O něco těžkopádnější podobu stejné konstrukce naleznete i v jazyce VBScript. Konstrukce ElseIf...Then se používá naprosto stejným způsobem, jako elif v jazyce Python. Ale setkáte se s ní zřídka, protože použití alternativního příkazu Select Case je jednodušší.

source: Putting it all together
cs: Teď to dáme všechno dohromady

source: So far many of our examples have been pretty abstract.
cs: Až dosud byly mnohé z našich příkladů velmi abstraktní.

source: To conclude let's take a look at an example that uses nearly everything we've learned about so far to introduce a common programming technique, namely displaying menus for controlling user input.
cs: Na závěr se podívejme na příklad, který používá téměř vše, co jsme se zatím naučili. Uvedeme si běžnou programovací techniku, konkrétně zobrazení menu pro řízení uživatelského vstupu.

source: Here is the code, followed by a brief discussion: menu = """ Pick a shape(1-3): 1) Square 2) Rectangle 3) Triangle 4) Quit """ shape = int(raw_input(menu)) while shape != 4: if shape == 1: length = float(raw_input("Length: ")) print "Area of square = ", length ** 2 elif shape == 2: length = float(raw_input("Length: ")) width = float(raw_input("Width: )) print "Area of rectangle = ", length * width elif shape == 3: length = float(raw_input("Length: ")) width = float(raw_input("Width: )) print "Area of triangle = ", length * width else: print "Not a valid shape, try again" shape = int(raw_input(menu))
cs: Zde máme kód, za kterým následuje krátká diskuse. menu = """ Vyberte si tvar (1-3): 1) Ctverec 2) Obdelnik 3) Trojuhelnik 4) Konec """ tvar = int(raw_input(menu)) while tvar != 4: if tvar == 1: strana = float(raw_input("Strana: ")) print "Plocha ctverce = ", strana ** 2 elif tvar == 2: delka = float(raw_input("Delka: ")) sirka = float(raw_input("Sirka: ")) print "Plocha obdelniku = ", delka * sirka elif tvar == 3: zakladna = float(raw_input("Zakladna: ")) vyska = float(raw_input(" Vyska: ")) print "Plocha trojuhelniku = ", zakladna * vyska / 2 else: print "Neplatny tvar. Zkute to znovu" tvar = int(raw_input(menu))

source: We've added just three lines (in bold) to the previous Python example but in so doing have significantly enhanced the usability of our program.
cs: K předchozímu příkladu jsme přidali pouhé tři řádky (označeny tučně), ale tato jednoduchá úprava výrazně zvýšila použitelnost našeho programu.

source: By adding a Quit option to the menu, plus a while loop we have provided the capability for the user to keep on calculating sizes of different shapes until she has all the information she needs.
cs: Doplněním volby Konec a přidáním cyklu jsme uživateli umožnili pokračovat ve výpočtech ploch různých tvarů až do doby, kdy získá všechny potřebné informace.

source: There is no need to rerun the program manually each time.
cs: Program již nemusí pokaždé ručně znovu a znovu spouštět.

source: The only other line we added was to repeat the raw_input(menu) shape selection so that the user gets the chance to change the shape and, ultimately, to quit.
cs: Kromě již zmíněných řádků jsme přidali pouze jeden řádek s raw_input(menu), který uživateli umožní volit různé tvary a na závěr také činnost programu ukončit.

source: What the program does is create the illusion to the user that the program knows what they want to do and does it correctly, acting differently depending what they input.
cs: Program tedy uživateli vytváří iluzi, že ví, co uživatel potřebuje. Na základě jeho volby se chová různým způsobem a správně provede odpovídající činnost.

source: In essence the user appears to be in control, whereas in fact, the programmer is in control since the he has anticipated all the valid inputs and how the program will react.
cs: Uživateli se v podstatě zdá, že postup řídí, zatímco ve skutečnosti má řízení v rukou programátor, který předvídal, jak mají vypadat všechny platné vstupy a jak má na ně program reagovat.

source: The intelligence on display is that of the programmer, not the machine - computers after all are stupid!
cs: Projevovaná inteligence tedy patří programátorovi, nikoliv stroji. Počítače jsou ve své podstatě hloupé!

source: You see how easily we can extend our program just by adding a few lines and combining sequences (the blocks that calculate the area), loops (the while loop) and conditionals (the if/elif structure).
cs: Povšimněte si jak snadno můžeme svůj program zdokonalit přidání pouhých pár řádků a zkombinováním posloupností (bloků pro výpočet plochy), cyklů (zde cyklus while) a podmíněných příkazů (konstrukce if/elif/else).

source: Dijkstra's three building blocks of programming.
cs: Jde o tři z Dijkstrových základních programátorských stavebních kamenů.

source: Having covered all three you can, in theory, now go out and program anything, but there are a few more techniques we can learn to make things a bit easier, so don't rush off just yet.
cs: Pokud zvládnete všechny tři, můžete teoreticky naprogramovat cokoliv. Ale můžeme se naučit ještě několik technik, které nám programování dále usnadní. Takže zatím mějte ještě trochu strpení.

source: Modifying collections from inside loops
cs: Změny v kolekci během provádění cyklu

source: We mentioned in the looping topic that modifying a collection from inside a loop was a difficult thing to do, but never got round to explaining how to do it!
cs: Když jsme se bavili o cyklech, zmínili jsme se o tom, že úprava kolekce během průchodu cyklem, konkrétné rušení prvků v procházené kolekci, nemusí být zcela jednoduché. Ale nevysvětlili jsme proč!

source: The reason is, we had to wait for branching to be explained first.
cs: Důvodem pro tento odklad byla skutečnost, že jsme museli nejdříve vysvětlit pojem větvení.

source: So here is the solution:
cs: Vraťme se tedy k řešení problému.

source: If we need to modify the elements of a collection in place we can use a while loop to make the changes as we iterate over it.
cs: Pokud potřebujeme měnit obsah kolekce během jejího zpracování (bez kopírování do jiné kolekce), můžeme k tomu využít vlastností cyklu while.

source: We can do this because in a while construct we have explicit control over the index, unlike the situation in a for loop where the index is automatically updated.
cs: Při použití konstrukce while totiž přímo pracujeme s obsahem indexové proměnné. Srovnejte to se situací, kdy se použije cyklus for, který indexovou proměnnou upravuje automaticky.

source: Let's see how to delete all zeros from a list:
cs: Podívejme se, jak můžeme ze seznamu vypustit všechny prvky s nulovou hodnotou:

source: myList = [1,2,3,0,4,5,0] index = 0 while index < len(myList): if myList[index] == 0: myList.remove(myList[index]) else: index += 1 print myList
cs: seznam = [1, 2, 3, 0, 4, 5, 0] index = 0 while index < len(seznam): if seznam[index] == 0: del seznam[index] else: index += 1 print seznam

source: The thing to note here is that we do not increment the index if we remove an item, we rely on the deletion moving everything up so that the old index value now points at the next item in the collection.
cs: Povšimněte si, že v případě odstraňování prvku neprovádíme zvyšování indexu. Spoléháme na to, že se při smazání položky vše posune, takže původní hodnota indexu bude poté ukazovat na další prvek kolekce.

source: We use an if/else branch to control when we increment the index.
cs: Zvyšování indexu se tedy provádí jen v jedné větvi konstrukce if/else.

source: It's very easy to make a mistake doing this kind of thing so test your code carefully.
cs: Při podobných obratech se můžeme velice snadno dopustit chyby, proto vždy funkčnost pečlivě otestujte.

source: There is another set of Python functions which are specifically designed for manipulating list contents and we look at them in the Functional Programming topic in the advanced section of the tutorial.
cs: V Pythonu můžeme používat jistou sadu funkcí, které byly přímo navrženy pro manipulaci s obsahy senamů. Seznámíme se s nimi v rámci tématu Funkcionální programování, tedy v části pro pokročilé.

source: Things to Remember
cs: Zapamatujte si

source: Use if/else to branch
cs: Pro větvení používáme if/else.

source: The else is optional
cs: Část else je nepovinná.

source: Multiple decisions can be represented using a Case or if/elif construct
cs: K rozhodnutí podle více z možných hodnot lze využít konstrukci typu Case nebo konstrukci if/elif.

source: Boolean expressions return True or False
cs: Boolovské výrazy vracejí hodnoty True nebo False.

source: Combining menus with Case constructs allows us to build a wide range of user controlled applications.
cs: Kombinování menu s konstrukcemi Case nám umožňuje vytvářet širokou škálu aplikací řízených uživatelem.
